from .. import loader
from asyncio import sleep 

def register(cb):
	cb(rainMod()) 
	
class rainMod(loader.Module):
	"""Дождь"""
	strings = {'name': 'RaInPoH'}
        
	async def raincmd(self, message):
		"""Используй .rain"""
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n\n\n\n\n\n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')
		await sleep(0.75)
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n    💧    💧     💧     💧     💧   💧\n\n\n\n\n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')
		await sleep(0.75)
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n    💧    💧     💧     💧     💧   💧\n💧    💧    💧    💧    💧    💧       \n\n\n\n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')
		await sleep(0.75)
		await message.edit(' 🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n   💧    💧     💧     💧     💧   💧\n💧    💧    💧    💧    💧    💧       \n    💧    💧    💧    💧    💧    💧     \n\n\n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')
		await sleep(0.75)
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n    💧    💧     💧     💧     💧   💧\n💧    💧    💧    💧    💧    💧       \n    💧    💧    💧    💧    💧    💧     \n💧    💧    💧    💧    💧    💧     \n\n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')
		await sleep(0.75)
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n    💧    💧     💧     💧     💧   💧\n💧    💧    💧    💧    💧    💧       \n    💧    💧    💧    💧    💧    💧     \n💧    💧    💧    💧    💧    💧     \n  💧      💧    💧  💧      💧  💧 \n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍') 
		await sleep(1.25)
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n\n💧    💧    💧    💧    💧    💧       \n    💧    💧    💧    💧    💧    💧     \n💧    💧    💧    💧    💧    💧     \n  💧      💧    💧  💧      💧  💧  \n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')
		await sleep(0.75)
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n\n\n    💧    💧    💧    💧    💧    💧     \n💧    💧    💧    💧    💧    💧     \n  💧      💧    💧  💧      💧  💧 \n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')
		await sleep(0.75)
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n\n\n\n💧    💧    💧    💧    💧    💧     \n  💧      💧    💧  💧      💧  💧 \n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')
		await sleep(0.75)
		await message.edit('🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️🌧️🌩️⛈️\n\n\n\n\n  ☔☔☔☔☔☔☔☔☔☔☔ \n🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍🧍')